# 1、万物皆函数
# 1.1 “Everything is a function”，约翰·麦卡锡 (John McCarthy) 的追随者，把这个作为信仰，他们认为“状态是万恶之源，变换才是宇宙真理”。与之对应的是面向对象编程的 “Everything is an object”。
# 1.2 其实这就是运动的还是静止的哲学问题，静止的是物质，运动的是能量。而我们知道，Albert Einstein爱因斯坦著名质能方程E = mc^2，告诉我们物质和能量是可以相互转换的。从这个角度上来说，everything is a function 还是 object,也就不难理解了。生命的意义，在于确定某个目标的存在（object），实现这个目标（function）。人的空虚感常常源于静止地看待世界，而忽略了运动的本质，生命不息，运动不止。
# 1.3 函数式编程强调的正是“能量”的流动，而不是“物质”的堆积。如果想要改变output,只能改变input,或者改变函数f()本身。衍生出来的解耦思维，可以把大问题拆解成小问题，把复杂拆解成简单。如果某个环节出现问题，可以单独替换这个环节，而不影响整体。
