# 1、言出法随
# 言出法随（拼音：yán chū fǎ suí），汉语成语，出自清代林则徐《奉旨前往广东查办海口事件传牌稿》，意思是话一说出口，法律就跟在后面；指法令一经公布就严格执行，如有违犯就依法处理。在笔者心中，这个成语的每个字有了新的解释，非常适合描述编程。编程是控制电流的艺术，本质是通过语言，控制计算机中的电流变化，从而实现对现实世界的模拟与控制，那么言出法随，正好描述了编程的四个层次：

# 言  自然语言 (中、英等)是意图 —— 人的想法。
# 出  高级语言 (Python、Java等)是逻辑 —— 业务代码；中级语言 (C语言等)是控制 —— 内存与硬件接口；低级语言 (机器码等)是指令 —— CPU 二进制命令。
# 法  电流变化 (0和1)是结果 —— 物理现象。
# 随  机器物理 (高低电压、电磁感应等)是现实 —— 物理开关动作。

# 言出法随是方法论，本blog的目标是，在言出法随的过程中，体会计算思维这个认识论，最终知晓知行合一的本体论。


# 2、从Python开始
# 从python入手，主要原因是，AI时代里，python可谓一枝独秀。本身作为胶水语言，站在无数语言的肩膀上，能够快速表达人的意图，损失点机器效率也无伤大雅。
# 我们先从python的大佬开始,先拜个山头：荷兰人，Guido Van Rossum“龟叔”。以后介绍linux和git的创始人linus torvalds“林纳斯”。
# python目前用3.0以上版本，本blog不介绍2.0了。至于用windows,还是mac,或是linux发行版，以后玩转操作系统了，我们再深扒这些，网上的安装教程太多，笔者十几年的windows用户，后来虽然支持开源，但习惯性使用ubuntu。个人觉着debian是真稳定，但没法子，用的nvidia显卡，而nvidia和linux大佬的恩怨，导致专用驱动在linux发行版上一言难尽，好在ubuntu上表现较好，咱也不纠结这个了，至于arch、red hat等发行版，咱也不多说，希望linux多点适配软件，少点发行版吧。
# 言归正传，python在不同系统上都有强大的库支持，随意安装。



